HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMinimcds_reg.h
/**
 * \file IfxMinimcds_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Minimcds_Registers_Cfg Minimcds address
 * \ingroup IfxSfr_Minimcds_Registers
 * 
 * \defgroup IfxSfr_Minimcds_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Minimcds_Registers_Cfg
 *
 * \defgroup IfxSfr_Minimcds_Registers_Cfg_Minimcds 2-MINIMCDS
 * \ingroup IfxSfr_Minimcds_Registers_Cfg
 *
 *
 */
#ifndef IFXMINIMCDS_REG_H
#define IFXMINIMCDS_REG_H 1
/******************************************************************************/
#include "IfxMinimcds_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Minimcds_Registers_Cfg_BaseAddress
 * \{  */

/** \brief MINIMCDS object */
#define MODULE_MINIMCDS /*lint --e(923, 9078)*/ ((*(Ifx_MINIMCDS*)0xFB718000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Minimcds_Registers_Cfg_Minimcds
 * \{  */
/** \brief 0, Clock Control Register */
#define MINIMCDS_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_CLC*)0xFB718000u)

/** \brief 4, OCDS Control and Status */
#define MINIMCDS_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_OCS*)0xFB718004u)

/** \brief 8, Module Identification Register */
#define MINIMCDS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_ID*)0xFB718008u)

/** \brief 10, MCDS Control Register */
#define MINIMCDS_CT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_CT*)0xFB718010u)

/** \brief 14, MCDS Signal Source Control */
#define MINIMCDS_MUX /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MUX*)0xFB718014u)

/** \brief 20, MCDS_TC Signal Source Control */
#define MINIMCDS_MUX_TC_RC /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MUX_TC_RC*)0xFB718020u)

/** \brief 200, Trace Buffer Write Pointer */
#define MINIMCDS_FIFONOW /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFONOW*)0xFB718200u)

/** \brief 204, Trace Buffer Bottom Register */
#define MINIMCDS_FIFOBOT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOBOT*)0xFB718204u)

/** \brief 208, Trace Buffer PRE/POST Register */
#define MINIMCDS_FIFOPRE /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOPRE*)0xFB718208u)

/** \brief 20C, Trace Buffer Top Register */
#define MINIMCDS_FIFOTOP /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOTOP*)0xFB71820Cu)

/** \brief 210, Trace Buffer Control Register */
#define MINIMCDS_FIFOCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOCTL*)0xFB718210u)

/** \brief 214, Trace Buffer Comparator Register */
#define MINIMCDS_FIFOWARN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOWARN*)0xFB718214u)

/** \brief 218, Trace Buffer Comparator Register */
#define MINIMCDS_FIFOWARN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOWARN*)0xFB718218u)

/** \brief 21C, FIFO Overflow Counter Register */
#define MINIMCDS_FIFOOVRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_FIFOOVRCNT*)0xFB71821Cu)

/** \brief 400, Clock Counter Register */
#define MINIMCDS_TSUREFCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TSUREFCNT*)0xFB718400u)

/** \brief 404, Clock Prescaler Register */
#define MINIMCDS_TSUPRSCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TSUPRSCL*)0xFB718404u)

/** \brief 408, Clock Counter Register */
#define MINIMCDS_TSUEMUCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_TSUEMUCNT*)0xFB718408u)

/** \brief 800, Event Definition Register 0 */
#define MINIMCDS_MCX_EVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718800u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT0.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT0.
*/
#define MINIMCDS_MCXEVT0 (MINIMCDS_MCX_EVT0)

/** \brief 804, Event Definition Register 1 */
#define MINIMCDS_MCX_EVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718804u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT1.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT1.
*/
#define MINIMCDS_MCXEVT1 (MINIMCDS_MCX_EVT1)

/** \brief 808, Event Definition Register 2 */
#define MINIMCDS_MCX_EVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718808u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT2.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT2.
*/
#define MINIMCDS_MCXEVT2 (MINIMCDS_MCX_EVT2)

/** \brief 80C, Event Definition Register 3 */
#define MINIMCDS_MCX_EVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB71880Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT3.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT3.
*/
#define MINIMCDS_MCXEVT3 (MINIMCDS_MCX_EVT3)

/** \brief 810, Event Definition Register 4 */
#define MINIMCDS_MCX_EVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718810u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT4.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT4.
*/
#define MINIMCDS_MCXEVT4 (MINIMCDS_MCX_EVT4)

/** \brief 814, Event Definition Register 5 */
#define MINIMCDS_MCX_EVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718814u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT5.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT5.
*/
#define MINIMCDS_MCXEVT5 (MINIMCDS_MCX_EVT5)

