HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMinimcds_reg.h
/** \brief 8A4, Action Definition Register 9 */
#define MINIMCDS_MCX_ACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188A4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT9.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT9.
*/
#define MINIMCDS_MCXACT9 (MINIMCDS_MCX_ACT9)

/** \brief 8A8, Action Definition Register 10 */
#define MINIMCDS_MCX_ACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188A8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT10.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT10.
*/
#define MINIMCDS_MCXACT10 (MINIMCDS_MCX_ACT10)

/** \brief 8AC, Action Definition Register 11 */
#define MINIMCDS_MCX_ACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188ACu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT11.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT11.
*/
#define MINIMCDS_MCXACT11 (MINIMCDS_MCX_ACT11)

/** \brief 8B0, Action Definition Register 12 */
#define MINIMCDS_MCX_ACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188B0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT12.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT12.
*/
#define MINIMCDS_MCXACT12 (MINIMCDS_MCX_ACT12)

/** \brief 8B4, Action Definition Register 13 */
#define MINIMCDS_MCX_ACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188B4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT13.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT13.
*/
#define MINIMCDS_MCXACT13 (MINIMCDS_MCX_ACT13)

/** \brief 8B8, Action Definition Register 14 */
#define MINIMCDS_MCX_ACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188B8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT14.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT14.
*/
#define MINIMCDS_MCXACT14 (MINIMCDS_MCX_ACT14)

/** \brief 8BC, Action Definition Register 15 */
#define MINIMCDS_MCX_ACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188BCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT15.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT15.
*/
#define MINIMCDS_MCXACT15 (MINIMCDS_MCX_ACT15)

/** \brief 8C0, Action Definition Register 16 */
#define MINIMCDS_MCX_ACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT16.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT16.
*/
#define MINIMCDS_MCXACT16 (MINIMCDS_MCX_ACT16)

/** \brief 8C4, Action Definition Register 17 */
#define MINIMCDS_MCX_ACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT17.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT17.
*/
#define MINIMCDS_MCXACT17 (MINIMCDS_MCX_ACT17)

/** \brief 8C8, Action Definition Register 18 */
#define MINIMCDS_MCX_ACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT18.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT18.
*/
#define MINIMCDS_MCXACT18 (MINIMCDS_MCX_ACT18)

/** \brief 8CC, Action Definition Register 19 */
#define MINIMCDS_MCX_ACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188CCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT19.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT19.
*/
#define MINIMCDS_MCXACT19 (MINIMCDS_MCX_ACT19)

/** \brief 8D0, Action Definition Register 20 */
#define MINIMCDS_MCX_ACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT20.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT20.
*/
#define MINIMCDS_MCXACT20 (MINIMCDS_MCX_ACT20)

/** \brief 8D4, Action Definition Register 21 */
#define MINIMCDS_MCX_ACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT21.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT21.
*/
#define MINIMCDS_MCXACT21 (MINIMCDS_MCX_ACT21)

/** \brief 8D8, Action Definition Register 22 */
#define MINIMCDS_MCX_ACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT22.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT22.
*/
#define MINIMCDS_MCXACT22 (MINIMCDS_MCX_ACT22)

/** \brief 8DC, Action Definition Register 23 */
#define MINIMCDS_MCX_ACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188DCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT23.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT23.
*/
#define MINIMCDS_MCXACT23 (MINIMCDS_MCX_ACT23)

/** \brief 8E0, Action Definition Register 24 */
#define MINIMCDS_MCX_ACT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT24.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT24.
*/
#define MINIMCDS_MCXACT24 (MINIMCDS_MCX_ACT24)

/** \brief 8E4, Action Definition Register 25 */
#define MINIMCDS_MCX_ACT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT25.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT25.
*/
#define MINIMCDS_MCXACT25 (MINIMCDS_MCX_ACT25)

/** \brief 8E8, Action Definition Register 26 */
#define MINIMCDS_MCX_ACT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT26.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT26.
*/
#define MINIMCDS_MCXACT26 (MINIMCDS_MCX_ACT26)

/** \brief 8EC, Action Definition Register 27 */
#define MINIMCDS_MCX_ACT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188ECu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT27.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT27.
*/
#define MINIMCDS_MCXACT27 (MINIMCDS_MCX_ACT27)

